# Создайте словарь {'a': 1, 'b': 2}. Добавьте ключ 'c' со значением 3, затем увеличьте 'a' на 5.
dict_1 = {'a': 1, 'b': 2}
dict_1['c'] = 3
dict_1['a'] += 5
print(dict_1)