# 4.  Заказ-чек
# Дана корзина [('яблоко', 3, 50), ('груша', 2, 80)…] (название, кол-во, цена). Соберите словарь название → итоговая_сумма, 
# выведите общую сумму чека.

cart = [('апельсин', 4, 60), ('банан', 2, 25), ('яблоко', 3, 50), ('груша', 2, 80), ('молоко', 1, 100)]
cart_dict = {}
total = 0

for item in cart:
    cost = item[1]*item[2]
    cart_dict[item [0]] = cost
    total += cost


print(cart_dict)
print(total)